import cv2
import numpy as np


H=np.array([[ 1.01430083e+00,  3.88854181e-03,  1.58694311e+01],
 [ 1.37173581e-02,  1.01804170e+00, -3.16441085e+00],
 [ 4.76462341e-05,  2.18167836e-05,  1.00000000e+00]])
x2=640
y2=480
x1 = (H[0, 0] * x2 + H[0, 1] * y2 + H[0, 2]) / (H[2, 0] * x2 + H[2, 1] * y2 + H[2, 2])
y1 = (H[1, 0] * x2 + H[1, 1] * y2 + H[1, 2]) / (H[2, 0] * x2 + H[2, 1] * y2 + H[2, 2])
print(x1,y1)


# # 画像1から画像2へのホモグラフィ行列
# H1 = np.array([[a, b, c],
#                [d, e, f],
#                [g, h, 1]])

# # 画像2から画像3へのホモグラフィ行列
# H2 = np.array([[i, j, k],
#                [l, m, n],
#                [o, p, 1]])

# # 画像3から画像1への変換を計算
# H_combined = np.dot(H2, H1)